DiplomD/src/Documents/СписокНаОтчисление/СписокНаОтчисление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписокНаОтчисление</name>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеЛиквидированныхАкадемЗадол</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчислить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Enums/ВидыОценокЗачет/ВидыОценокЗачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОценокЗачет</name>
  <enumValues>
    <name>Зачтено</name>
  </enumValues>
  <enumValues>
    <name>НеЗачтено</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/Documents/ЗачетнаяКнижкаСтудента/ЗачетнаяКнижкаСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетнаяКнижкаСтудента</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАттестационныхДисцилин</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перезачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийСеместровыйРейтинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/ФормированиеУчебныхГрупп/ФормированиеУчебныхГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеУчебныхГрупп</name>
  <attributes>
    <name>НомерГруппы</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСтудентов</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчислен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбучения</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАттестации</name>
      <type>
        <types>EnumRef.АттестационныеМероприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/СписокСтудентов/СписокСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокСтудентов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллВступительныхИспытаний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетнаяКнижка</name>
    <type>
      <types>DocumentRef.ЗачетнаяКнижкаСтудента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Documents/СписокНаОтчисление/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура СеместрПриИзмененииНаСервере()
	Объект.ТЧ.Очистить();
	
	ЗапросСтуденты = Новый запрос; 
	ЗапросСтуденты.Текст = "ВЫБРАТЬ
	                       |	СписокСтудентов.Ссылка КАК Ссылка,
	                       |	СписокСтудентов.Группа КАК Группа
	                       |ИЗ
	                       |	Справочник.СписокСтудентов КАК СписокСтудентов
	                       |ГДЕ
	                       |	СписокСтудентов.СтатусЗачисления = &СтатусЗачисления"; 
	ЗапросСтуденты.УстановитьПараметр("СтатусЗачисления",Истина); 
    рез = ЗапросСтуденты.Выполнить().Выгрузить(); 
	Для каждого стр из рез Цикл 
	
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Студент КАК Студент,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Группа КАК Группа,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Оценка КАК Оценка,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Долг КАК Долг
	               |ИЗ
	               |	Документ.ЗачетнаяКнижкаСтудента.СписокАттестационныхДисцилин КАК ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин
	               |ГДЕ
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Семестр = &Семестр
	               |	И ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Студент = &Студент";
	
	 Запрос.УстановитьПараметр("семестр",Объект.Семестр); 
	 Запрос.УстановитьПараметр("Студент",Стр.Ссылка); 
	 Р = Запрос.Выполнить().Выгрузить(); 
	 Для каждого строка из Р Цикл 
		 Если ПустаяСтрока(Строка.Оценка) ИЛИ Строка.Оценка = Перечисления.ВидыОценокЗачет.НеЗачтено ИЛИ Строка.Долг = Истина 
			 Тогда 
			 О = объект.ТЧ.Добавить(); 
			 О.Студент = Стр.Ссылка;
			 О.Группа = Стр.Группа; 
			 О.КоличествоНеЛиквидированныхАкадемЗадол = 1; 
			 
			 
		 КонецЕсли;
		 
			 
		 
	 КонецЦикла; 
	 
 КонецЦикла;  
 
 А = Объект.ТЧ.Выгрузить(); 
 А.Свернуть("Студент,Группа","КоличествоНеЛиквидированныхАкадемЗадол"); 
 Объект.ТЧ.Загрузить(А); 
 

	
КонецПроцедуры

&НаКлиенте
Процедура СеместрПриИзменении(Элемент)
	СеместрПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтчислитьСтудентовНаСервере()
	
	Для каждого стр из Объект.ТЧ Цикл 
		Если Стр.Отчислить = Истина Тогда
			Спр= Справочники.СписокСтудентов.НайтиПоНаименованию(Стр.Студент).ПолучитьОбъект(); 
			Спр.СтатусЗачисления = Ложь; 
			Спр.Записать();
			Док = Документы.ФормированиеУчебныхГрупп.НайтиПоРеквизиту("НомерГруппы",Стр.Группа).ПолучитьОбъект(); 
			Парам = Новый Структура; 
			парам.Вставить("Студент",Стр.Студент); 
			НС = Док.СписокСтудентов.НайтиСтроки(Парам); 
			Для каждого Нстр из НС Цикл 
				
				НСтр.Отчислен = Истина;
				
			КонецЦикла; 
			Док.Записать(РежимЗаписиДокумента.Запись); 
			Док.Записать(РежимЗаписиДокумента.Проведение); 
			
			Зачетка = Документы.ЗачетнаяКнижкаСтудента.НайтиПоРеквизиту("Студент",Стр.Студент).ПолучитьОбъект(); 
			Зачетка.Удалить();
			
		КонецЕсли; 
		
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчислитьСтудентов(Команда)
	ОтчислитьСтудентовНаСервере();
КонецПроцедуры
